load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 300
      arrivalRate: 80
scenarios:
    - engine: "socketio"
      flow:
        - emit:
            channel: "join"
            data: {
              room: "room1"
            }
        - emit:
            channel: "join"
            data: {
              room: "room2"
            }
        - emit:
            channel: "message"
            data: {
              room: "room1",
              msg: "Hii"
            }
        - emit:
            channel: "message"
            data: {
              room: "room1",
              msg: "Hello"
            }
        - emit:
            channel: "message"
            data: {
              room: "room2",
              msg: "Hii"
            }
        - emit:
            channel: "message"
            data: {
              room: "room2",
              msg: "Hello"
            }
        - emit:
            channel: "notification"
            data: {
              msg: "Changed Profile Pic"
            }